pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_ctrl.h
    uint32_t    cipher_type;    //!<  Cipher_type ID
	uint8_t     des;            //!<  DES state: 1=Active, 0=Inactive
	uint8_t     trides;         //!<  3DES state: 1=Active, 0=Inactive
	uint8_t     aes;            //!<  AES state: 1=Active, 0=Inactive
	uint8_t     chacha;         //!<  Chacha(including poly1305) state: 1=Active, 0=Inactive
	uint8_t     isDecrypt;      //!<  Decryption state: 1=Enable, 0=Disable
    uint8_t     reserved1[3];   //!<  Reserve

    uint32_t    auth_type;      //!<  Hash_type ID
    uint8_t     isHMAC;         //!<  HMAC state: 1=Active, 0=Inactive
    uint8_t     isMD5;          //!<  MD5 state: 1=Active, 0=Inactive
	uint8_t     isSHA1;         //!<  SHA1 state: 1=Active, 0=Inactive
	uint8_t     isSHA2;         //!<  SHA2 state: 1=Active, 0=Inactive

    /**
     * Sha2_type ID: 0=None of this mode of sha2, 28=sha2_224 mode(output size is 28bytes),
     * 32=sha2_256 mode(output size is 32bytes)
     */
	uint8_t     sha2type;       //!< Sha2_type ID
    uint8_t     reserved2[3];   //!<  Reserve

    uint8_t     mix_mode_type;  //!< Mix mode type: SSH/ESP/SSL
    uint8_t     reserved3[3];   //!<  Reserve
    
	// hash
	uint32_t    enc_last_data_size;     //!<  Encrypted message of last data size
	uint32_t    aad_last_data_size;     //!<  Additional authenticated data of last data size
    uint32_t    hashpad_last_data_size; //!<  Mix mode Hash padding of last data size
    uint32_t    encpad_last_data_size;  //!<  Mix mode Encryption padding of last data size

    uint32_t    lenAuthKey;     //!<  Key length of authenticated hash
    const uint8_t *pAuthKey;    //!<  Pointer to variable that points the key address of authenticated hash
	uint32_t    digestlen;      //!<  Digest length of hash

	// sequential hash
	uint8_t     hmac_seq_hash_first;    //!<  Sequential hash first one state:  1=Active, 0=Inactive
	uint8_t     hmac_seq_hash_last;     //!<  Sequential hash last one state: 1=Active, 0=Inactive
    uint8_t     hmac_seq_is_recorded;   //!<  Recording a sequential hash: 1=Active, 0=Inactive
    uint8_t     hmac_seq_buf_is_used_bytes;     //!<  Recorded data size in sequential hash buffer
	uint32_t    hmac_seq_hash_total_len;        //!<  Total data length of sequential hash
    uint32_t    hmac_seq_last_msglen;   //!<  Last message length of sequential hash
    uint8_t     *hmac_seq_last_message; //!<  Pointer to variable that points the last message address of sequential hash

    uint32_t 	lenCipherKey;   //!<  Key length of Cipher
    const uint8_t *pCipherKey;  //!<  Pointer to variable that points the key address of cipher

	uint32_t    a2eo;           //!<  Additional authenticated data length
    uint32_t    apl_aad;        //!<  Padding length of additional authenticated data
    uint32_t    enl;            //!<  Crypto message length
    uint32_t    apl;            //!<  Padding length of crypto message
    uint32_t    hash_padlen;    //!<  Mix mode hash padding length
    uint32_t    hashpad_pad;    //!<  Mix mode padding length of hash padding
    uint32_t    enc_padlen;     //!<  Mix mode encryption padding length
    uint32_t    encpad_pad;     //!<  Mix mode padding length of encryption padding

    uint8_t     *ipad;          //!<  Pointer to variable that points the inner padding data address of HMAC
    uint8_t     *opad;          //!<  Pointer to variable that points the outer padding data address of HMAC
    // crc
    int32_t     crc_order;      //!<  Cyclic redundancy check order

    //read_crc_setting used
    uint32_t    crc_sel;        //!<  Register value of cyclic redundancy check order
    uint32_t    crc_oswap;      //!<  Register value of cyclic redundancy check refout
    uint32_t    crc_iswap;      //!<  Register value of cyclic redundancy check refin
    uint32_t    crc_oxor;       //!<  Register value of cyclic redundancy check xor
    uint32_t    crc_init;       //!<  Register value of cyclic redundancy check init
    uint32_t    crc_poly;       //!<  Register value of cyclic redundancy check polynomial

    // cache
    uint8_t     is_dst_first_cache_used;    //!<  Destination descriptor that used first cache line: 1=Active, 0=Inactive
    uint8_t     is_dst_last_cache_used;     //!<  Destination descriptor that used last cache line: 1=Active, 0=Inactive
    uint8_t     reserved4[2];   //!<  Reserve

    /**
     * 32 bytes aligned buffer that store inner and outer padding data
     */
    volatile uint8_t g_IOPAD[CRYPTO_PADSIZE*2+32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store initial vector for AES_GCM/Chacha20/Chacha_poly1305
     */
    volatile uint8_t  gcm_iv[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store command register data of source descriptor
     */
    volatile uint8_t  cl_buffer[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store digest result of Hash
     */
    volatile uint8_t  digest_result[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store tag result of HMAC
     */
    volatile uint8_t  tag_result[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store first cache line of source descriptor
     */
    volatile uint8_t  src_first_cache_line[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store last cache line of source descriptor
     */
    volatile uint8_t  src_last_cache_line[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store first cache line of destination descriptor
     */
    volatile uint8_t  dst_first_cache_line[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store last cache line of destination descriptor
     */
    volatile uint8_t  dst_last_cache_line[32] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store 64 bytes sequential buffer data of Hash
     */
    volatile uint8_t  hmac_seq_buf[64] __attribute__((aligned(32)));

    /**
     * 32 bytes aligned buffer that store first cache line of crc_dma modeh
     */
    volatile uint8_t  crc_first_cache_line[32] __attribute__((aligned(32)));

    /**
     * 64 bytes aligned buffer that store padding value
     */
    volatile uint8_t  padding[64] __attribute__((aligned(64)));

    /**
     * Callback function pointer : Clean D-cache.
     */
    void (*arch_clean_dcache_by_size)(uint32_t start_address, int32_t size);

    /**
     * Callback function pointer : Invalidate D-cache.
     */
    void (*arch_invalidate_dcache_by_size)(uint32_t start_address, int32_t size);

    /**
     * Callback function pointer : Wait available fifo nodes of source descriptor.
     */
    int (*fifo_wait_func)(void *pIE1);

    /**
     * Callback function pointer to \ref g_crypto_pre_exec : Initialize the notified mechanism.
     */
    int (*pre_exec_func)(void *pIE1);

    /**
     * Callback function pointer to \ref g_crypto_wait_done : Wait to be notified after
     * interrupt service routine processed over.
     */
    int (*wait_done_func)(void *pIE1);

    uint32_t reserved5[12];   //!<  Reserve
} hal_crypto_adapter_t, *phal_crypto_adapter_t ;

