pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_ctrl.h
    int (*hal_crypto_crc_cmd)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

    int (*hal_crypto_crc_dma)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

	uint32_t (*hal_crypto_crc_get_result)(hal_crypto_adapter_t *pcrypto_adapter);

    int (*hal_crypto_crc32_cmd)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

    int (*hal_crypto_crc32_dma)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

// Misc functions for ram code patch
    int (*hal_crypto_engine) (hal_crypto_adapter_t *pcrypto_adapter,
                              IN const u8 *message,     IN const uint32_t msglen,
                              IN const u8 *pIv,         IN const uint32_t ivlen,
                              IN const u8 *paad,     IN const uint32_t aadlen,
                              OUT u8 *pResult, OUT u8 *pTag);

    void (*hal_crypto_engine_get_result) (hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult, uint32_t len, u8 *pTag);

    void (*hal_crypto_set_srcdesc) (hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr);

    void (*hal_crypto_set_dstdesc) (hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr);

    void (*hal_crypto_engine_setup_cl_buffer) (hal_crypto_adapter_t *pcrypto_adapter);    

    uint32_t reserved[11]; // reserved space for next ROM code version function table extending.
} hal_crypto_func_stubs_t;

/** @} */ /* End of group hs_hal_crypto */

/*
 * crypto rom code for other functions
 */
void hal_crypto_engine_set_digestlen_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t auth_type);

void hal_crypto_engine_set_key_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                        IN const u8 *pCipherKey, IN const int lenCipherKey,
                                        IN const u8 *pAuthKey,   IN const int lenAuthKey);

int hal_crypto_engine_set_security_mode_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                 IN const uint32_t cipher_type, IN const uint32_t auth_type,
                                                 IN const void *pCipherKey,     IN const uint32_t lenCipherKey,
                                                 IN const void *pAuthKey,       IN const uint32_t lenAuthKey);

int hal_crypto_engine_pre_exec_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

int hal_crypto_engine_wait_done_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_start_packet_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_engine_auth_calc_apl_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, 
                                              IN const uint32_t a2eo, IN const uint32_t msglen,
                                              IN const uint32_t hash_padlen, IN const uint32_t enc_padlen);

void hal_crypto_modify_enc_last_data_size_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                   IN const u8 *message,IN const uint32_t msglen);

uint32_t hal_crypto_dstdesc_fifo_cnt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_set_dstdesc_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr);

uint32_t hal_crypto_srcdesc_fifo_cnt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_set_srcdesc_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr);

void hal_crypto_engine_setup_cl_buffer_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_engine_srcdesc_generate_cl_key_iv_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                           const u8 *p_iv, uint32_t ivLen);

int hal_crypto_engine_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                               IN const u8 *message, 	IN const uint32_t msglen,
                               IN const u8 *pIv, 		IN const uint32_t ivlen,
                               IN const u8 *paad,     IN const uint32_t aadlen,
                               OUT u8 *pResult, OUT u8 *pTag);

void hal_crypto_engine_get_result_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult,
                                           uint32_t len, u8 *pTag);

int hal_crypto_send_seq_buf_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest);
 
void hal_crypto_engine_set_encrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

void hal_crypto_engine_set_decrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

int hal_crypto_cipher_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
    IN const u8 isEncrypt,  IN const u32 cipher_type,
    IN const u8 *message,   IN const u32 msglen,
    IN const u8 *iv,        IN const u32 ivlen,
    IN const u8 *aad,       IN const u32 aadlen,
    OUT u8 *pResult,        OUT u8 *pTag);

void hal_crypto_engine_reset_rtl8710c(phal_crypto_adapter_t pcrypto_adapter);

void hal_crypto_en_ctrl_rtl8710c(int en);

/*
 * crypto rom code for init/deinit 
 */
int hal_crypto_engine_init_rtl8710c(phal_crypto_adapter_t pcrypto_adapter);

int hal_crypto_engine_deinit_rtl8710c(phal_crypto_adapter_t pcrypto_adapter);

/*
 * crypto rom code for authentication algorithms
 *   auth_type = 
 * {
 *   AUTH_TYPE_MD5,
 *   AUTH_TYPE_SHA1,
 *   AUTH_TYPE_SHA2_224_ALL,
 *   AUTH_TYPE_SHA2_256_ALL,
 *   AUTH_TYPE_HMAC_MD5,
 *   AUTH_TYPE_HMAC_SHA1,
 *   AUTH_TYPE_HMAC_SHA2_224_ALL,
 *   AUTH_TYPE_HMAC_SHA2_256_ALL
 * }
 */
int hal_crypto_auth_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
                                  const u8 *pAuthKey, const u32 lenAuthKey);

int hal_crypto_auth_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
                                     IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest);

int hal_crypto_auth_update_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
                                    IN const u8 *message, IN const u32 msglen);

