pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_ctrl.h
int hal_crypto_auth_final_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest);

int hal_crypto_auth_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
                             IN const u8 *message, IN const u32 msglen,
                             IN const u8 *pAuthKey, IN const u32 lenAuthKey, OUT u8 *pDigest);

/*
 * crypto rom code for cipher algorithms
 *   cipher_type = 
 * {
 *   CIPHER_TYPE_AES_ECB,
 *   CIPHER_TYPE_AES_CBC,
 *   CIPHER_TYPE_AES_CFB,
 *   CIPHER_TYPE_AES_OFB,
 *   CIPHER_TYPE_AES_CTR,
 *   CIPHER_TYPE_AES_GCTR,
 *   CIPHER_TYPE_AES_GMAC,
 *   CIPHER_TYPE_AES_GHASH,
 *   CIPHER_TYPE_AES_GCM
 * }
 */
int hal_crypto_cipher_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
                                    IN const u8 *key, IN const u32 keylen);

int hal_crypto_cipher_encrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
                                       IN const u8 *message, IN const u32 msglen,
                                       IN const u8 *iv, IN const u32 ivlen,
                                       IN const u8 *aad, IN const u32 aadlen,
                                       OUT u8 *pResult, OUT u8 *pTag);

int hal_crypto_cipher_decrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
                                       IN const u8 *message, IN const u32 msglen,
                                       IN const u8 *iv, IN const u32 ivlen,
                                       IN const u8 *aad, IN const u32 aadlen,
                                       OUT u8 *pResult, OUT u8 *pTag);
/*
 * crypto rom code for mix mode
 *   mix_mode_type = 
 * {
 *   CRYPTO_MIX_MODE_SSH_ENC,
 *   CRYPTO_MIX_MODE_SSH_DEC,
 *   CRYPTO_MIX_MODE_ESP_ENC,
 *   CRYPTO_MIX_MODE_ESP_DEC,
 *   CRYPTO_MIX_MODE_SSL_TLS_ENC
 * }
 */
int hal_crypto_mix_mode_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u32 auth_type,
                                     IN const u8 *cipher_key, IN const u32 cipher_keylen,
                                     IN const u8 *auth_key, IN const u32 auth_keylen);

int hal_crypto_mix_mode_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 mix_mode_type,
                                         IN const u32 cipher_type,
                                         IN const u8 *message, IN const u32 msglen,
                                         IN const u8 *iv, IN const u32 ivlen,
                                         IN const u8 *aad, IN const u32 aadlen,
                                         IN const u32 auth_type,
                                         IN const u8 *hash_pad, IN const u32 hash_padlen,
                                         IN const u8 *enc_pad,  IN const u32 enc_padlen,
                                         OUT u8 *pResult, OUT u8 *pTag);

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)

void read_crc_setting_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

int hal_crypto_crc_wait_done_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

uint32_t  hal_crypto_crc_get_result_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter);

int hal_crypto_crc_setting_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
    IN int order, IN uint32_t polynom, IN uint32_t crcinit, IN uint32_t crcxor, IN uint32_t refin, IN uint32_t refout);

int hal_crypto_crc_cmd_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen);
int hal_crypto_crc_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen);

int hal_crypto_crc32_cmd_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen);
int hal_crypto_crc32_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen);

#endif

#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_CRYPTO_CTRL_H */

